# Working with Data Time

In [3]:
import numpy as np
import pandas as pd

In [4]:
date = pd.read_csv("order.csv")
time = pd.read_csv("messages.csv")

In [6]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [7]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [9]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [10]:
# converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [11]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### 1. Extract year

In [12]:
date['date_year'] = date['date'].dt.year

In [13]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

### 2. Extract Month

In [24]:
# with name
date['date_month_no'] = date['date'].dt.month_name()
# with out name
# date['date_month_no'] = date['date'].dt.month
date.head()

        date  product_id  city_id  orders  date_year date_month_no date_day_no
0 2019-12-10        5628       25       3       2019      December     Tuesday
1 2018-08-15        3646       14     157       2018        August   Wednesday
2 2018-10-23        1859       25       1       2018       October     Tuesday
3 2019-08-17        7292       25       1       2019        August    Saturday
4 2019-01-06        4344       25       3       2019       January      Sunday

In [26]:
# with name
date['date_day_no'] = date['date'].dt.day_name()
# with out name
# date['date_day_no'] = date['date'].dt.day

In [22]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_day_no
0,2019-12-10,5628,25,3,2019,12,Tuesday
1,2018-08-15,3646,14,157,2018,8,Wednesday
2,2018-10-23,1859,25,1,2018,10,Tuesday
3,2019-08-17,7292,25,1,2019,8,Saturday
4,2019-01-06,4344,25,3,2019,1,Sunday

### is weekend?

In [29]:
date['date_is_weekend'] = np.where(date['date_day_no'].isin(['Sunday','Saturday']),1,0)

date.drop(columns=['product_id','city_id','orders']).head()

        date  date_year date_month_no date_day_no  date_is_weekend
0 2019-12-10       2019      December     Tuesday                0
1 2018-08-15       2018        August   Wednesday                0
2 2018-10-23       2018       October     Tuesday                0
3 2019-08-17       2019        August    Saturday                1
4 2019-01-06       2019       January      Sunday                1

### Extract week of the year

In [31]:
date['date_week'] = date['date'].dt.week
date.drop(columns=['product_id','city_id','orders']).head()

C:\Users\abdul\AppData\Local\Temp\ipykernel_11856\174856922.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['date_week'] = date['date'].dt.week

        date  date_year date_month_no date_day_no  date_is_weekend  date_week
0 2019-12-10       2019      December     Tuesday                0         50
1 2018-08-15       2018        August   Wednesday                0         33
2 2018-10-23       2018       October     Tuesday                0         43
3 2019-08-17       2019        August    Saturday                1         33
4 2019-01-06       2019       January      Sunday                1          1

### Extract Quarter

In [32]:
date['quarter'] = date['date'].dt.quarter
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_day_no,date_is_weekend,date_week,quarter
0,2019-12-10,2019,December,Tuesday,0,50,4
1,2018-08-15,2018,August,Wednesday,0,33,3
2,2018-10-23,2018,October,Tuesday,0,43,4
3,2019-08-17,2019,August,Saturday,1,33,3
4,2019-01-06,2019,January,Sunday,1,1,1

### Extract semester

In [33]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_day_no,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,December,Tuesday,0,50,4,2
1,2018-08-15,2018,August,Wednesday,0,33,3,2
2,2018-10-23,2018,October,Tuesday,0,43,4,2
3,2019-08-17,2019,August,Saturday,1,33,3,2
4,2019-01-06,2019,January,Sunday,1,1,1,1

### Extract Time elapsed between dates

In [34]:
import datetime

today = datetime.datetime.today()

In [37]:
today-date['date']

0     1158 days 15:18:40.935466
1     1640 days 15:18:40.935466
2     1571 days 15:18:40.935466
3     1273 days 15:18:40.935466
4     1496 days 15:18:40.935466
                 ...
995   1586 days 15:18:40.935466
996   1527 days 15:18:40.935466
997   1375 days 15:18:40.935466
998   1440 days 15:18:40.935466
999   1214 days 15:18:40.935466
Name: date, Length: 1000, dtype: timedelta64[ns]

In [41]:
(today - date['date']).dt.days

0      1158
1      1640
2      1571
3      1273
4      1496
       ...
995    1586
996    1527
997    1375
998    1440
999    1214
Name: date, Length: 1000, dtype: int64

In [42]:
# month passed

np.round((today-date['date']) / np.timedelta64(1,'M'),0)

0      38.0
1      54.0
2      52.0
3      42.0
4      49.0
       ...
995    52.0
996    50.0
997    45.0
998    47.0
999    40.0
Name: date, Length: 1000, dtype: float64

In [43]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [44]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [45]:
time['date'] = pd.to_datetime(time['date'])

In [47]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [50]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [51]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

### Time difference

In [52]:
today - time['date']

0     3344 days 14:28:40.935466
1     3208 days 15:38:40.935466
2     3694 days 14:57:40.935466
3     2996 days 14:47:40.935466
4     3393 days 16:07:40.935466
                 ...
995   3983 days 14:28:40.935466
996   3304 days 16:04:40.935466
997   3769 days 15:41:40.935466
998   3885 days 15:44:40.935466
999   3157 days 15:53:40.935466
Name: date, Length: 1000, dtype: timedelta64[ns]

In [53]:
# Extract in seconds
(today- time['date']) / np.timedelta64(1,'s')

0      2.889737e+08
1      2.772275e+08
2      3.192155e+08
3      2.589077e+08
4      2.932133e+08
           ...
995    3.441833e+08
996    2.855235e+08
997    3.256981e+08
998    3.357207e+08
999    2.728220e+08
Name: date, Length: 1000, dtype: float64

In [54]:
# in minutes
(today - time['date']) / np.timedelta64(1,'m')

0      4.816229e+06
1      4.620459e+06
2      5.320258e+06
3      4.315128e+06
4      4.886888e+06
           ...
995    5.736389e+06
996    4.758725e+06
997    5.428302e+06
998    5.595345e+06
999    4.547034e+06
Name: date, Length: 1000, dtype: float64

In [55]:
#  in hours

(today - time['date']) / np.timedelta64(1,'h')

0      80270.478038
1      77007.644704
2      88670.961371
3      71918.794704
4      81448.128038
           ...
995    95606.478038
996    79312.078038
997    90471.694704
998    93255.744704
999    75783.894704
Name: date, Length: 1000, dtype: float64